In [1]:
import pandas as pd
import numpy as np

In [15]:
pwd

'C:\\Users\\ESTUDIANTE.F10KLAB104PC13\\Documents\\GABO\\SEMANA2\\Viernes26'

In [19]:
dataFrame = pd.read_excel('Ejemplo_excel.xlsx')

In [23]:
dataFrame

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [31]:
dataFrame['e'] = [20,21,22,23]

In [33]:
dataFrame

   Unnamed: 0   a   b   c   d   e
0           0   0   1   2  20  20
1           1   4   5   6  21  21
2           2   8   9  10  22  22
3           3  12  13  14  23  23

In [35]:
dataFrame.to_excel('Salida_Ejemplo.xlsx',sheet_name='TuEx')

In [37]:
dataFrame

   Unnamed: 0   a   b   c   d   e
0           0   0   1   2  20  20
1           1   4   5   6  21  21
2           2   8   9  10  22  22
3           3  12  13  14  23  23